INSERT INTO membership (membership_name, membership_simple_text, membership_accession_text, membership_date, membership_max) VALUES
('모험가의 클럽', '정기적으로 해외에 야생으로 놀러가는 모임입니다.','여권 필수입니다!! 해외여행 결격사유 없는분만' ,'2024-03-10', 15),
('예술 애호가 협회', '다양한 전시회에 놀러가요~', '온도 36.5도 이하는 안받고 있습니다!' ,'2024-04-12', 50),
('스포츠 융합 그룹', '다양한 스포츠 활동을 즐기는 클럽입니다.', '너무 병약한분만 아니면 전부~' , '2024-05-20', 80),
('미식 탐험가 클럽', '요리와 음식에 열정적인 사람들의 모임입니다.', '조리 관련 자격증 있는분들 우대합니다! 20~30대만 받고있습니다' , '2024-06-15', 60),
('캠핑족', '주로 경기,강원 지역 캠핑을합니다', '1달에 1회이상 참여는 필수입니다.(특별한 사유 제외) 개인장비 필수!!' , '2024-07-25', 10),
('음악 감상 집단', '주기적은 음감회와 노래방 놀러가요', '음악 좋아하시는분이라면 모두 환영' ,'2024-08-10', 70),
('책벌레의 안식처', '독서를 즐기는 사람들을 위한 독서 모임입니다.', '매달 마지막주 토요일에 독서토론회 가능한분만!!' , '2024-09-18', 40),
('국내 프로 스포츠 관람단', '다양한 국내 프로 스포츠를 관람하러 가는 클럽입니다.', '20살 이상인 분들만!! 경기끝나고 회식 자주 참여가능한분만!!' , '2024-10-30', 100),
('창의적인 사진 작가모임', '다양한 국내명소를 찾아다니면서 사진찍으러 다녀요~', '개인 카메라 있으신분들만 받아요', '2024-11-12', 50),
('춤춤춤춤춤', '같이 춤춰용', '몸치여도 알려드립니다! 춤을 사랑하면 모두가능' , '2024-12-20', 80),
('그린 피스', '환경운동에 동참해서 녹생성장 이루어요',  '다양한 환경운동 가능하신분만~' ,'2024-01-15', 60),
('시간탐험대', '우리나라의 역사에관한 다양한 토론을 하는 클럽입니당.', '한국사 자격증 3급 이상만 받아요~' , '2024-02-22', 10),
('영화 감상 클럽', '주말마다 강남역 메가박스에서 같이 영화봐요', '온도 20도 이하만 아니면 가능!!' , '2024-03-30', 90),
('자원봉사단', '자원봉사와 사회적 활동을 중시하는 클럽입니다.', '자주 활동가능하신분들 신청해주세요' , '2024-04-14', 50),
('IT공유 연구회', '새로운 IT기술에 관심 있는 사람들의 모임입니다.',  '다양한 분야의 개발자분들 환영' ,'2024-05-20', 80),
('명상과 웰빙 서클', '요가와 명상에 관심 있는 사람들을 위한 모임입니다.', '온도 40도 이상인 분들만!' , '2024-06-25', 40),
('아이유 애호가', '아이유 콘서트 티켓팅부터 관람까지 합깨해요',  '아이유 팬이면 누구나!' ,'2024-07-10', 60),
('식물 사랑단', '식물을 사랑해서 육식만하는 모임입니다',  '채식주의자는 받지 않고있습니다','2024-08-15', 50),
('오늘은 실험왕', '과학과 실험을 좋아하는 사람들의 모임입니다.', '매달 회비 30만원 이상 가능해야합니다.', '2024-01-30', 70),
('시네마 팬 클럽', '50~80년대 명작 영화를 보러 댕겨용', '서울 근교에 사시는 누구나', '2023-10-25', 80),
('가택 경비대', '집에서 안나가고 주말에 게임이나 하죠?', '게임 좋아하는 누구나 가능!', '2023-11-10', 60);
INSERT INTO membership (membership_name, membership_simple_text, membership_accession_text, membership_date, membership_max) VALUES
('클래식 음악 애호가 클럽', '클래식 음악회에 정기적으로 놀러가요', '클래식 좋아하시는분들은 누구나! 악기 연주가능자 우대합니다.', '2023-04-05', 40),
('뷰티 & 패션 서클', '뷰티와 패션에 관심 있는 사람들의 커뮤니티입니다.', '20대만 가능합니다', '2024-01-20', 70),
('사이드 프로젝트 클럽', '사이드 프로젝트를 하고싶은데 혼자하기 무섭다면 당장가입', '1개 이상의 프로그래밍 언어 가능자만!', '2023-02-15', 50),
('맛있으면 0칼로리', '매주 맛짐탐방을 다니는 클럽입니다','전국 방방곳곳 맛집들 다니실분' ,'2024-03-30', 60),
('잠실 독수리', '잠실구장 한화경기 같이 보러가요~', '이글스 팬들이라면 누구나!', '2024-04-15', 70),
('진짜훌리건', '수원삼성블루윙스 서포터즈입니다', '같이 직관 ㄱㄱ할분만', '2020-04-20', 70),
('인스타 중독자들', '서로 팔로우 숫자 늘리는 팁같은거 공유해요', '인스타 팔로워 1000명 이상만', '2023-04-05', 70),
('손뜨개모임', '손뜨개하면서 즐겁게 얘기해요', '아무나', '2023-04-05', 10),
('LRT / Running Crew', ':달리는_여성: 혼자보다는 함께 하는 가치, 함께 뛰어요 :주자:', '나이 : 85년생 ~ 00년생 (25세 - 40세)/월 1회 러닝 모임 참석', '2023-07-05', 100),
('부산대표타짜들', '부산 서면에서 같이 이색취미 홀덤 배우고 친해지실분:하트2:', '실제로 돈걸고 하실분이나 도박이라고 생각하시는 분은 들어오지마세요:총격전:', '2023-06-25', 70),
('8090추억의 보드게임', '추억의 문구점 보드게임 및 일반 보드게임 플레이 모임입니다.', '아무나', '2024-05-15', 20),
('두산 팬모여라', '잠실에서 경기할 때 가끔씩 만나서 같이 보러 가실 분 찾아요!', '25살 아래셨으면 좋겠어요', '2024-05-15', 30),
('맛집투어:하트_3개가_있는_웃는_얼굴:', '청주인들 맛집투어 하실 분들 모이세요ㅎㅎ', '청주사람', '2023-12-15', 20),
('날아라 슈퍼보드', ':스케이트보드:스케이트보드 같이 타요!', '강서/마포구 왕초보', '2023-11-15', 20),
('급찐급빠 러닝:달리는_여성::피부톤-2::달리는_남성::피부톤-2:', ':확성기:급찐급빠에 좋은 인터벌 러닝 같이 뛰어요:달리는_여성::피부톤-2::달리는_남성::피부톤-2:', '종교 전도 활동 금지 ,  정치활동 금지', '2023-08-25', 70),
('맛있는 녀석들', '가볍게 밥먹으러 오고싶은분들 맛집에 진심인 분들', '아무나', '2023-07-15', 20),
('우리둥지 아지트', '힐링하며 재밌게 즐길 수 있는 그런 모임을 찾으신다면!', '가입만 하시고 활동 안하실 분들은 뒤로가기 살짝 눌러주세요~:윙크:', '2023-10-18', 30),
('AB형 모여라!', '여러분들 혹시 혈액형 관련 이야기 좋아하시나요? :휴식::휴식:', 'AB형이신분만!', '2023-10-15', 20),
(':책:책이랑 친해지는 시간:라벨:', '저희 함께하면... 묵혀둔 책들 완독 할 수 있겠죠??! :안아주는_얼굴:', '월에 한 번 이상은 다른 취미활동 같이 할분만~!', '2023-11-11', 20),
('한국이지만 영어쓰고 싶어 모임(영어회화)', '만나자마자부터 모든 말을 영어로만 말하다가 헤어지는 모임', '나이/성별 제한 없습니다. 한국국적 아니어도 됩니다. 영어 잘하고 싶은 사람! ㅎㅎ', '2023-04-13', 70),
('센트럴 카공 파크', '서교동/연희동/연남동 + 동교동/합정동/창천동/상수동/망원동 근처 카페 그리고 온라인에서 카공하실 분들을 위한 클럽입니다.', '학생, 취준생, 프리랜서, 재택러 모두 환영합니다 :두_손을_들고_있는_사람:', '2022-12-15', 20),
('막걸리 파티', '막걸리를 먹고 싶은데 명분이 없어 만드는 모임', '00년생부터 90년생까지 남녀 불문', '2023-09-25', 30),
('옥토버 아카데미', '지금의 불만스러운 삶을 변화시키기 위해 내일 무엇을 하나요?', '성장욕구는 있지만 방법을 모르는 사람', '2024-06-05', 20),
(':호랑이:전국 기아 타이거즈 팬클럽:야구:️아기호랑이 V12', '혼자 응원하기엔 아쉬워서 클럽 모임을 열게 되었습니다', '수도권 지방 모두 대 환영 ', '2023-05-15', 20);
-- 맴버쉽 50개 추가
INSERT INTO membership (membership_name, membership_simple_text, membership_accession_text, membership_date, membership_max) VALUES
('산화진미', '산:산:타고 회:물고기: 먹으러 가요!', '특별한 규칙이 없이, 편한 마음으로 참여하는 모임입니다. ', '2023-01-05', 60),
('울산 노래방', '환영합니당', '음치.박치 상관없이 노래 부르기 좋아하시는 분들', '2023-07-05', 30),
(':별똥별::별똥별:별밤캠핑:별똥별::별똥별:', '좋은사람 멋진곳 여행다니시면서 즐거운 추억등을 함께 만들어 가실분들 모집합니다', '쏠로분들만 받을게요:이빨을_보이며_웃고_있는_얼굴::이빨을_보이며_웃고_있는_얼굴:', '2023-08-05', 70),
('영토 클럽(영화와 토론, 사회... 그리고 인문학)', '영화는 진리를 위한, 혹은 진리를 찾기 위한 초당 24개의 거짓" (미카엘 하네케)', '나이/직업/성별에 따라 상대를 차등대우하지 않습니다. ', '2023-06-05', 100),
(':미니디스크:힙합처돌이', '저희 클럽은 힙합을 메인으로 하는 친목 클럽입니다(영화보기, 밥 먹으러 가기, 술 마시기 등도 가능)', '힙합으로 위아더월드 할 수 있는 분', '2023-12-05', 50);


SELECT * FROM membership;
INSERT INTO membership (membership_name, membership_simple_text, membership_accession_text, membership_date, membership_max) VALUES
('빅데이터 구축' , '혁신적인 데이터 보고서 만들자!' , '자바스크립트 , 자바 , mySQL 모집중' , '2022-08-03',15),
('뭔두','아라비카 커피를 좋아하는사람들','아무조건없이 커피 좋아하시는분들 환영합니다','2024-09-09', 10),
('영등포 배식단' , '고등학생 봉사활동시간 채우시는분들도 환영합니다' , '땀흘리는거 좋아하시는분 너무 환영입니다 ^^','2024-08-01' , 30),
('척추 레츠 기립!' , '자세 교정, 비워냄의 최고인 절 명상 수련을 할게요' , '척추층만증, 앉아서 일하시는분들 어서오세요~~','2024-07-11' , 25),
('내 음악을 나눠줄게, 네 음악도 나눠줄래?' , '나라가허락한 유일한 Drug 함께해요' ,'노래 잘하든 못하는 다 환영합니다', '2023-07-11' , 20),
('AI 작곡 모르면 나만손해 ' , '드디어 나온 Ai 작곡 클래스! 살면서 경험하지 못한분 없게 해주세요 🥺' , '4차 산업형명에 동참하실분들 어서오세요','2024-05-05' , 10),
('🥕당근으로 월 200만원 버는 방법💰' , '👉오직 문토에서만 선착순으로 이 가격으로 해드립니다!' , '바니바니 당근당근','2024-06-12' , 12),
('떠나지니 in 단양🪂 ' , '함께 하러 가실 분들 모여라 🙌🏻🫶🏻🙌🏻🫶🏻' ,'20대 분들만 모집해요 ^^;', '2024-10-25' , 11),
('한강 피크닉' , '나들이 가기 좋은 계절이 왔네요~ 한강 피크닉 같이 가봐요~' ,'자전거 있으신분들만요!', '2024-08-11' , 12),
('【다모고🏫 수학여행】' , '불국사,석굴암... 역사적인 유적지를 탐방합시당' , '역사과나 국문과 환영합니다','2024-08-11' , 22),
('(가을바람 솔솔🏕)일상에서 탈출! 21~22일 남해 거제 여행' , '날씨도 시원해지는데 하하호호 웃으며 즐기실분!!' , '차멀미 없으신분들이면 좋겠어요 ㅎ','2024-07-11' , 23),
('[추석연휴] 남양주에 위치한 LP카페로 떠나는 추억여행' , '남양주 진접읍에 위치한 LP카페에서 추억여행 어떠세요?' , '레트로 좋아하시는분들 환영합니다','2024-08-23' , 20),
('카디오: 드라이브 라디오' , '🚨차라는 협소한 공간에서 같이 있어야하기 때문에 배려심 많고 매너있는분들과 함께하고 싶습니다' , '매너 필수!','2024-09-05' ,4),
('롯데월드🎢추석 연휴 놀이공원 눈치게임 시작👀' , '15회차 8명 / 16회차는?' , 'E 환영!','2024-07-05' ,8),
('9/28~29 안동 하회선유줄불놀이 & 청송 주왕산' , 'K-불놀이, 안동 하회선유줄불놀이!!!' ,'소화기 들고오세요', '2024-09-28' , 12),
('토익/오픽 도와드릴게용!! (2명한정무료) 영어과외 받으실분?~' , '여유시간이 좀 생기고 영어 좋아해서 가르치는걸 한번 해보고 싶은 생각이 들었어요' , '피드백 받으시는거 좋아하시면 좋습니다^^','2024-05-05' , 2),
('신림 카페에서 각자 일 공부 할일 하실분' , '신림 카페에서 각자 일 공부 할일 하실분' , '웹툰작가, 개발자 환영','2024-05-07' , 20),
('🍑 여름 복숭아 올라가는 복숭아 타르트 만들기' , '🙏베이킹 처음 해 보시는 분들도, 해 보신 분들도, 모두모두 환영합니다!' , '복숭아 알레르기 있으면 안돼욧!','2024-07-22' , 12),
('피지컬살롱: 바벨 & 식단코칭' , '운동과 건강에 대한 고민, 경험, 계획 등을 교류하고 운동을 매개체로 서로 소통하는 모임입니다.🎵' , '로이더 오면 반으로 접어버립니다','2024-07-30' , 5),
('🏟강남 혼성풋살 여성멤버 충원해요 ^^!.⚽️' , '초보자.무경험. 모두 환영합니다 ! 다들 처음하시는분들이 많아요 ㅎㅎ' , '아무나 오세여','2024-08-29' , 6),
('[고전 문학] 데미안 함께 읽어요!' , '데미안은 그런 우리에게 정말 중요한 책입니다 살면서 한 번쯤 읽어봐야하는 책' , '데미안 책 지참해주세요!','2024-08-01' , 33),
('[3기] 무료+리워드💗[단 한 줄 챌린지🌈]✨️인생을 바꾸는 독서법✨️' , '✨️누구나 책읽기를 좋아하게 만들어드립니다✨️' , '학창시절 공부안하고 책만 읽으신분들 어서오세요~','2023-05-11' , 25),
('영어 프리토킹 도전기!' , ' 영어에 익숙하지 않은 사람들도 함께하며 서로 도우며 성장할 수 있는 자리입니다' , '배우는 자세는 꼭 필요합니다','2024-02-12' , 18),
('마음그리기' , '잘그리지 않아도 내 마음을 표현하면 되는 시간인 것 같아요 같이 더 재미있는 활동도 하면 좋을것 같아요!' , '힐링이 필요하신분! 다 환영합니다' , '2024-01-22', 20),
('TRUE value (부동산)' , '뻔한 얘기를 하는것 보다 앞서갈수 있는 부동산 분야만큼은 도움을 드릴수 있습니다' , '노하우 강의가 필요하신분은 언제든 문의 주시길 바랍니다' , '2024-07-10' , 20),
('따릉이(자전거)' , '운동겸 예쁜 한강도 보고 이야기 하면서 친해지면서 따릉이로 함께 달려 보면 좋을거 같아요!' , '그리고 자전거를 잘못타셔도 괜찮아요 (저도 잘 못타요ㅎㅎ)' , '2024-09-09' , 15 ),
('힐링취미 도자기만들기 베이스 친목도모🌿' , '흙을 만지면 스트레스 해소와 힐링은 덤 같은 또래끼리 만나며 도자기 만들고 한주 어떻게 지냈는지 이야기해봐요!' , '피부 좋아지고 싶은분들 강추!' , '2024-03-03' , 19),
('노션 같이 하실분' , '노션으로 개인포트폴리오 제작중에 있는데 같이 하실분 구해욤' , '노션 or 깃헙 경험자분들 환영합니다!' , '2024-04-10' , 4),
('❤️#핵소름#아드레날린#대낮에 호러쇼❤️' , '※ 물지 않음 / 목줄을 안 하고 있을 시 촬영 불가능 ※' , '※ 본인이 알고 있는 무서운 이야기가 없어도 참여 가능👐 ※' , '2023-12-08' , 30 ),
('유토피아: 노웨어, 나우 히어 함께가요🙌' , '같이 가서 함께 사진 찍어주고 전시회 보실 분 구합니다:)' , '20대초중반이랑 같이 친구하시는 거에 거리낌 없으시면 좋겠어요!!' , '2023-11-09' , 45 ),
('일하고 놀고 일하고 연결되고' , '혼자 작업하는 사람들 - 프리랜서, 1인사업가, 디지털노마드, 학생 - 외로움은 그만 ✋' , '모여서 잘 일하고 잘 놀자 그리고 느슨하게 연결되고싶어요! 🔗' , '2024-01-12' ,20 ),
('인천,서울,경기 20대 친구 컴온!!' , '다양한 활동을 함께 즐기고, 친해지실 인천,서울,경기 사는 20대분들을 모집합니다❗️(96~05)' , '경기도는 광명,김포,부천,일산,파주,의정부 등 서울,인천 인근 지역인원만 지원해주세요!' , '2023-05-10' , 80 ),
('뮤지컬이랑 공연보러다니실분들.' , '부산에서 뮤지컬 클래식 재즈공연 모든공연 같이보러다니실분들 모십니다.' , '혼자보는것보다 교감하면 훨씬좋습니다.' , '2023-08-19' , 30),
('<서른앓이> 청춘들의 북클럽 📚' , '<서른앓이>는 깊은 지식을 나누는 모임이 아닙니다. 학구적인 연구회가 되길 바라지 않습니다' , '하늘 한 번 올려다볼 여유 없이 치열한 하루를 살아내고 있을 이 시대의 진정한 청춘여러분!' , '2024-01-10' , 50 ),
('AI 창작실 2 (포스트 휴먼‘s 별장)' , '💡우리는 인공지능 기술을 활용하여 새로운 아이디어를 탐구하고, 창의적인 작품을 만들고, 세상을 더욱 풍요롭게 만드는 공간입니다.' , '“Ai 창작실은 누구나 쉽게 Ai 창작물을 만들수 있게 연구하는 곳입니다. 쉬었다 가세요”' , '2024-06-06' , 35 ),
('세밀화 좋아하는 사람' , '세밀화 및 섬세한 그림에 관심있는 분으로서 모이는 방입니다 😁' , '서로를 배려하고 예의 있고 그림으로서 진심이고 사랑하는분 다른사람들을 위해 또 다른 그림을 위해 도움줄수 있는분' , '2024-09-03' , 40 ),
('서대문 떡잎마을방범대' , '내가 지키는 지구! 우리가 만드는 동네!' , '마음 따뜻한 동네 청년들!!!' , '2024-09-01' , 100 ),
(' 향수 체험 매장! 아로마포레스트 창업설명회로 초대합니다' , '명품/니치향수를 마음껏 시향하고 마음에 드는 향수를 집적 만들 수 있는 향수 체험 매장입니다' , '최소비용으로 창업하고싶으신분 환영합니다!' , '2024-08-27' , 45 ),
('매월 열리는 게임 개발자를 위한 쇼케이스 & 네트워킹 - 젬파이(Zempie) 9월 밋업 x 유니티 코리아' , '유니티 & 프렌즈와 함께하는 특별한 젬파이 밋업 9월 이벤트에 초대 합니다!' , '업계 전문가 분들의 세션, 개발자분들의 피칭 그리고 유니티 프렌즈 개발사의 게임 시연 및 네트워킹 시간이 마련되어 있으니
많은 관심과 참여 신청 부탁드립니다!' , '2024-07-01' , 200 ),
('온라인사업 창업전이거나 입문자에게 필요한 스터디 강의 교육' , '온라인 쇼핑몰 창업 준비부터 온라인 판매 전문가 되기까지 함께 성장하는곳입니다!' , '도서나 북스터디 모임이 아닙니다' , '2024-04-29' , 50 ),
('인연을 꿈꿀 때, 찾아가는 소개팅 카페 , 모카링' , '설레는 인연을 만나고 싶으시다면, 얼리버드 혜택과 함께 지금 바로 예약해보세요!' , '💖 연령대 30-35세, 전문직∙공무원∙IT업계∙대학원, 키 175 이상 ' , '2024-09-03' , 20 ),
('양천마을 수비대' , '봉사활동도 하고 관계도 형성할 수 있는 기회!!' , 'K2 지참 요망' , '2024-01-25' , 250 ),
('마피아 데이' , '혼자와서 같이 놀다가는 보드게임 카폐예요!' , '게임을 모르셔도 괜찮아요!' , '2024-07-15' , 10 ),
('야, 너두 돈 벌 수 있어!' , '직장 외 월200~300만원 추가로 버는 법' , '부자되고싶은분 어서오세요^0^' , '2024-02-18' , 45 ),
('소금 창작 예배' , '묵상 - 성경을 입체적으로 읽을 수 있습니다. ' , '*그림을 잘 그리지 못하셔도 괜찮습니다. 누군가에게 보여주기 위한 창작이 아니기 때문입니다.' , '2023-11-01' , 30 ),
('동탄 빛 독서모임' , '22년 11월부터 시작된 성인 독서모임입니다. 모임의 참석도 자유롭게~ 독후 활동도 자유로운~ 편안한 독서모임입니다' , '스스로 2주에 한 권은 책을 읽으려는 의지는 필요합니다' , '2024-01-01' , 50 ),
('유 알 낫 얼론' , '나에게 집중하는 시간을 가지며 유쾌하고 속 시원한 자기표현까지 할 수 있는 기회!' , '고립은둔청년분들을 위한 예방 프로그램입니다' , '2023-02-28' , 300 ),
('SidoHUB' , '인공지능을 활용하여 글/그림 전문가가 될 수 있습니다. 나를 브랜딩하고 수익화까지!' , '컴퓨터 초보분들도 할수있습니다 지금바로 도전하세요!' , '2023-07-11' , 100 ),
('SMAT 서비스경영 자격증 단기스터디' , '취창업정보가 가득한 청년일다방에서 올해 취업준비를 시작해보세요!' , '승무원, 호텔, 마케터, 사무 등 서비스 분야의 취업을 준비하는 분들이 많이 취득하려는 청년분들 환영합니다' , '2023-12-02' , 80 );



















